TAL_INT_GIT/Sample Data/NUPCO/HOS_WareHouse/wareHouse_SOAP/wareHouse_SOAP

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
   <soap:Body>
      <ser:SOAP_SAP_WareHouseOperationRequest xmlns:ser="http://www.talend.org/service/" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
         <!--Optional:-->
         <PLANT>C2C1</PLANT>
         <!--Optional:-->
         <SLOC/>
         <!--Optional:-->
         <ZDate>2020-12-14</ZDate>
         <!--Optional:-->
         <ZTime/>
      </ser:SOAP_SAP_WareHouseOperationRequest>
   </soap:Body>
</soap:Envelope>